---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.AtLeastOneEquipmentOnDuty
source: html/44b6cb71-efa9-41a4-3c8e-984614f3a087.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.AtLeastOneEquipmentOnDuty Property

There should be at least one equipment on duty.

## Syntax (C#)
```csharp
public static FailureDefinitionId AtLeastOneEquipmentOnDuty { get; }
```